{"index":{}}
{"html":"Our office is operating remotely and available to assist you via admissions.ucr.edu/ask. More on Campus Return, COVID-19 and temporary changes to admission requirements. Admitted students, check MyUCR for news.×Skip to main contentA to Z ListingCampus MapFind PeopleNewsSkip to main contentUniversity of California, RiversideSearchQuick AccessMyUCRAdmitted StudentsFreshman TransferOut-of-StateInternationalCost to AttendFreshmanTransferOut-of-StateInternationalAbout RiversidePublicationsGet UCR in "}
{"index":{}}
{"html":"COVID-19 information and guidance. Information about and returning to campus. The Accellion attack impacted University of California (UC), as it previously disclosed in early April. To get the latest information about this event, our response, and available credit protection services, please visit this page.×A to Z ListingCampus MapFind PeopleNewsSkip to main contentUniversity of California, RiversideSearchQuicklinksVisitEventsMake a GiftCampus MapJobsLibraryParking and TransportationApplyUC Riv"}
{"index":{}}
{"html":"Our office is operating remotely and available to assist you via admissions.ucr.edu/ask. More on Campus Return, COVID-19 and temporary changes to admission requirements. Admitted students, check MyUCR for news.×Skip to main contentA to Z ListingCampus MapFind PeopleNewsSkip to main contentUniversity of California, RiversideSearchQuick AccessMyUCRAdmitted StudentsFreshman TransferOut-of-StateInternationalCost to AttendFreshmanTransferOut-of-StateInternationalAbout RiversidePublicationsGet UCR in "}
{"index":{}}
{"html":"In-person tours are currently cancelled, but we hope to reopen in the upcoming months. Please check back. More on Campus Return and COVID-19. Access UC’s temporary changes to admission requirements.×Skip to main contentA to Z ListingCampus MapFind PeopleNewsSkip to main contentUniversity of California, RiversideSearchQuick AccessMyUCRAdmitted StudentsFreshman TransferOut-of-StateInternationalCost to AttendFreshmanTransferOut-of-StateInternationalAbout RiversidePublicationsGet UCR in Your InboxCo"}
{"index":{}}
{"html":"Our office is operating remotely and available to assist you via admissions.ucr.edu/ask. More on Campus Return, COVID-19 and temporary changes to admission requirements. Admitted students, check MyUCR for news.×Skip to main contentA to Z ListingCampus MapFind PeopleNewsSkip to main contentUniversity of California, RiversideSearchQuick AccessMyUCRAdmitted StudentsFreshman TransferOut-of-StateInternationalCost to AttendFreshmanTransferOut-of-StateInternationalAbout RiversidePublicationsGet UCR in "}
{"index":{}}
{"html":"Skip to main contentUniversity of California, RiversideSearchUC Riverside Campus Return SearchWhat to ExpectStudents and ParentsEmployeesPlanningPlanning FrameworkPlans & ProtocolsWorking GroupsCOVID ManagementInstructional ContinuityResearch Ramp-upOperational ContinuityStudent ServicesNews & AnnouncementsCovid-19 Prevention PlanResourcesDashboardUCR COVID-19Student HealthWellness CheckUCR HealthCOVID NotifyCalifornia ALLKeep TeachingRiverside County COVID-19COVID-19 VaccinesCAMPUS RETURNCampus"}
{"index":{}}
{"html":"Skip to main contentPlanning Budget & AdministrationReport a Incident, Injury or Safety ConcernReport a COVID-19 or Public Health ConcernSearchUC Riverside Environmental Health & Safety SearchAbout EH&SOrganizational ChartPrograms & PoliciesStaff DirectoryWho Do I Call?How Can We Help?Programs & PoliciesFood Permit RequestHazardous Waste Pick UpLog into Chemicals, INSPECT, LHAT, & WASTe AppsPersonal Protective Equipment (PPE)Programs & ServicesTrainingCOVID-19 Prevention TrainingReportCOVID-19 C"}
{"index":{}}
{"html":"Skip to main content                   Admissions Requirements How to apply Tuition & financial aid Campuses & majors Apply now Twitter     Facebook     Search    Freshman requirementsSubject requirement (A-G)GPA requirementExam requirementAdmission by examAdmission by exceptionEnglish language proficiencyUC graduation requirementsAdditional information forCalifornia residentsOut-of-state studentsHome-schooled studentsTransfer requirementsPreparing to transferBasic requirementsTransfer PathwaysP"}
{"index":{}}
{"html":"Skip to main contentUniversity of California - Riverside Login PageUCR NetID:Password:CAPSLOCK key is turned on!Sign InForgot your password?Learn about MFANeed help?"}
